#include "ch.h"
#include "hal.h"

#include "i2c_local.h"
#include "main.h"
#include "param.h"
#include "storage.h"

/*
 ******************************************************************************
 * DEFINES
 ******************************************************************************
 */

/*
 ******************************************************************************
 * EXTERNS
 ******************************************************************************
 */

/*
 ******************************************************************************
 * GLOBAL VARIABLES
 ******************************************************************************
 */
/* interface #2 */
static const I2CConfig i2cfg2 = {
    OPMODE_I2C,
    400000,
    FAST_DUTY_CYCLE_2,
//    100000,
//    STD_DUTY_CYCLE,
};

/*
 *******************************************************************************
 * EXPORTED FUNCTIONS
 *******************************************************************************
 */
void I2CInitLocal(void){

  i2cStart(&I2CD1, &i2cfg2);
  ParametersInit(); /* читает настройки из EEPROM по I2C*/
  chThdSleepMilliseconds(1);
  StorageInit();    /* init uptime and trip storage*/
  chThdSleepMilliseconds(1);
}
