#ifndef KBD_H
#define KBD_H
//============================================================================
// Драйвер 5-ти кнопочной клавиатуры                                     
//============================================================================
// Семенчик В.Г. 01.10.2009
//============================================================================

#include "SysConfig.h"
//----------------------------------------------------------------------------

/// Состояние каждой клавиши описывается двумя битами
#define KEY_OFF        0
#define KEY_OFF_TO_ON  1
#define KEY_ON         3
#define KEY_ON_TO_OFF  2
//----------------------------------------------------------------------------
/*
struct S_KBDMsg {
  U32 uiID;
  U32 uiState;  
};
//----------------------------------------------------------------------------
*/
class C_KBD
{
private:
  U32 uiState;
  void KBDTest(U32 uiInput, U32 &uiKeyMask, U32 uiKBDMask);
public:
  C_KBD(void);
  friend void Task_KBD(void);
};
//----------------------------------------------------------------------------

extern C_KBD KBD;
extern OS_TID idtKBD;
__task void Task_KBD(void);
//----------------------------------------------------------------------------

#endif //#ifndef KBD_H
