#ifndef SYSTIME_H
#define SYSTIME_H
//============================================================================
// Драйвер 5-ти кнопочной клавиатуры                                     
// Клавиатуру подключаю через PIOA                                                    
//============================================================================
// Семенчик В.Г. 01.10.2009 - 17.10.2009  
//============================================================================

#include <RTL.h>
//----------------------------------------------------------------------------

class C_SysTime {
private:
  U32 uiTime;
public:
  U32 DiffTime(U32 uiOldTime);
  friend void Task_SysTime(void);
};
//----------------------------------------------------------------------------

extern C_SysTime SysTime;
extern OS_TID idtSysTime;
__task void Task_SysTime(void);
//------------------------------------------------------------------------------

#endif //#ifndef SYSTIME_H
