//=============================================================================
// Системное время  
// Через заданный в тиках интервал времени инкрементирует переменную uiTime, 
// которая используется для определения интервалов времени между событиями
//=============================================================================
// Семенчик В.Г. 03.10.2009 - 17.10.2009                                                      
//=============================================================================

#include "SysConfig.h"
#include "systime.h"
//----------------------------------------------------------------------------

C_SysTime SysTime;
OS_TID idtSysTime;
//----------------------------------------------------------------------------

__task void Task_SysTime(void)
{
  os_itv_set (SYSTIME_PERIOD);
  for(;;){
    os_itv_wait ();
    ++SysTime.uiTime;
  }
}
//----------------------------------------------------------------------------

U32 C_SysTime::DiffTime(U32 uiOldTime)
{
   if(uiTime >= uiOldTime) return uiTime - uiOldTime;
   return (0xFFFFFFFF - uiOldTime) + uiTime + 1;
}
//----------------------------------------------------------------------------

